<template>
    <div class="blogDetail">
        <h2 style="margin-top: 58px; margin-left: 360px;">{{blog.title}}</h2>
        <p v-html="blog.content" style="margin-left: 400px;">

        </p>
        <p style="margin-left: 340px; margin-top: 80px; margin-bottom: 36px; float: right;">
            {{blog.updateTime}}
        </p>
    </div>
</template>

<script>
    export default {
        name: "blog-detail",
        data() {
            return {
                blog: {
                    title: "博客标题，关于SpringBoot",
                    content: "Lucy\n" +
                        "首先介绍下成长背景：我妈妈这边，她是最小，从小在家非常受宠，在我和我爸我妈组成的家庭里几乎说一不二。她的哥哥一般也都让着她。但是她对同事都还挺客气的。另外就是我姥姥姥爷家等级思想根深蒂固。姥爷在世时候永远是上座，我妈从来不敢和我姥爷顶嘴（虽然我姥爷是非常和善的人），他们的观念里根深蒂固就是晚辈不能和长辈“顶嘴”。另外，我姥姥是家庭妇女，思维比较狭隘，在家里和各个亲戚闹得不可开交，敏感，脆弱，随便一句话就觉得是攻击。在这种家庭的影响下，我妈是一个在家“没接没完”的人，常常揪住一句话不放，对人不对事，非常敏感，非常爱贴标签扣大帽子。别人对她做的一百件事情好，抵不过一次做错一句话说错。一件小事闹好多天。这么多年，我爸对她都忍了。\n" +
                        "\n" +
                        "我自己在这样的家庭长大，也难免受影响。从小很乖，曾经一度认为是“孝为天”。小时候只是觉得妈妈很难亲近，有心里话愿意跟爸爸说不愿意和她说，不喜欢她对我的评判。这十年来，独立自强，重新刷三观，慢慢对以前和她的矛盾意识到根源问题在哪儿。开始挣扎，开始反抗，开始捍卫我自己和我的家庭的边界。不再觉得要按照她希望的百依百顺的方式孝顺（她觉得孝顺孝顺顺当先，她也是这样对我姥爷的）\n" +
                        "\n" +
                        "我老公的成长环境很自由。我公婆虽然都是知识分子，但是他们的成长背景是农民家庭，没有那么多的规矩和等级思想。他们养育我老公也是比较放养，从没要求我老公一定听他们的。我觉得唯一一点比较遗憾的，我老公是个不大会说话的人，有时候说话会比较扎耳，尽管他并不是针对对方，也并不是恶意，他自己很快都忘了，但是听起来就是会觉得扎耳生硬被冒犯。另外他平时不会哄人不会用语言表达感激也不会靠语言套近乎来拉拢关系。\n" +
                        "\n" +
                        "Lucy\n" +
                        "上面说了大概的背景，这些是矛盾发生的很重要的因素，也是我觉得很无力改变或者改善的点。\n" +
                        "\n" +
                        "举个最简单例子，我婆婆在这时候，早饭做好了，端到我老公眼皮底下，他低头看电脑，眼皮都不抬，更不用说谢谢。我婆婆无所谓，我爸妈显然受不了。这样小事开始都是我爸妈不满意的地方，我跟我老公沟通，他改，之后就好多了。但这些都是表面的事情。骨子里一个不受礼节、长辈晚辈关系约束，一个很讲究长幼尊卑、要晚辈“孝和顺”，养儿防老观念根深蒂固，生活在一个屋檐下，碰撞就会比较剧烈。\n" +
                        "\n" +
                        "我爸妈来了快一年，我妈大闹了3次。第一次导火索是，孩子不要她抱他下车，要我。她要修理一下孩子的“任性”，关上了车门。孩子一个人在车里大哭，我忍不住去开车门，想跟孩子沟通。她就生气爆发了。\n" +
                        "\n" +
                        "连着之前很多小事（没跟我说但都闷在心里），比如没有把我们的主卧让给她住，没有给她准备她需要的小盆（当时我快生了还搬家，忘记很多事情，她没直接跟我说，觉得我应该主动想到）等等，然后她就一个人在外面走一天，不吃饭不吃药（她有高血压），我们怎么都找不到，威胁说要回老家，我真的上网改票，她又说不能给你爸退票，我不同意说要回你们一起回，她就砸我电脑，甚至推我（我当时怀孕9个月+了）。再之后闹僵，我几次喊她想和解她都不理我。我陪孩子玩她又生气，说你倒是挺高兴啊。这件事闹了一周。\n" +
                        "\n" +
                        "Lucy\n" +
                        "第二次是我老公生日前一天。午休时候我爸妈在用硬纸板做模子，想之后比着硬纸板模子剪软玻璃给我家的餐桌铺上。软玻璃是他们之前费力运过来的。是为我们好，保护桌子。我老公睡醒了，看到了，说不行，不要铺软玻璃。会把桌子的漆沾掉（我老公原话我记不清了，不是特别客气就是了，但是在我看来也是对事不对人）。然后我妈就火了。闹了好几天，我老公生日当天闹得特别不痛快，我老公道歉了，在我听来已经算是很诚恳，我妈不依不饶，依旧骂的很刺耳（虽然不带脏字）。我老公生日当天，我妈拒绝和我们出去吃饭，还不允许我去，说“你敢去的？！”最后我还是去了，当然一定是要去的。这件事也是闹了很多天\n" +
                        "\n" +
                        "第三次，就是昨天。早上我不在家有课。孩子在家玩，推沙发，把姥爷吵醒了。姥爷睡觉和身体不太好，醒了就不再睡。这时我妈就说：“小宝啊，你什么时候才能懂事啊？”我老公立马说：“妈您别这么说，他还小呢，现在懂事就不是小孩了。您就跟他说’不要吵到姥爷’就行了”我妈当时脸色就沉了，我老公立刻意识到说错了，找补着跟孩子说：“小宝不能吵爷爷啊，你看姥姥姥爷这么辛苦”。但是已经晚了，我妈等我回来就跟我抹着眼泪控诉，然后说，我再也不管你们家孩子了，我跟你们家孩子说话都不能说了。我哪儿说错了？我老公晚上回家跟她道歉说：“早上说什么您别往心里去。以后我每天早起管孩子，早点送他上幼儿园” 我妈依然不依不饶。今天我生日，我妈早上跟我说，下周计划去旅游我和你爸不去了，你们三口子带着孩子去吧。\n" +
                        "\n" +
                        "中间还有小事，比如前几周有一天，孩子一定要在教室等他最喜欢的老师。我妈觉得这样影响老师回家。我解释说，我当时在试图跟孩子沟通，跟老师解释，也不是每天都这样耽误老师下班，几个月了才一次。我妈就火了，骂了我一顿，说我不懂事，说的都狗屁，老师嫌你烦你知不知道啊。\n" +
                        "\n" +
                        "Lucy\n" +
                        "好像我太絮叨了……这些矛盾根源就是我妈要求子女顺从、一切以他为中心，凡事都想得很周到（她的确是这样对我姥爷的），不会有疏忽，更不会有顶撞。对自己的孩子（也就是我），很多时候缺乏尊重和理解。\n" +
                        "\n" +
                        "这些我忍忍就过去了。但是当第三代教育问题出现时，我和老公有不同意见，特别是我老公，忍不住提，她就会觉得冒犯，特别是语气措辞再不注意的话，就会特别往心里去。给我压力特别大的是，她一闹就是好多天，整个家里氛围都很紧张很难受。\n" +
                        "\n" +
                        "我妈帮我们带孩子非常辛苦，帮我的小家很多很多，这些我都很感激。但是不是说辛苦帮了别人，别人就要因为感激百分百把不同意见放心底。我或许可以忍，但我觉得让我老公忍是对他不公平。他有他措辞不当的地方，他之后也会道歉。虽然他不会平时对我爸妈甜言蜜语说感激，但是他已经算是挺客气（相比较对我公婆而言），花钱从来没打过磕巴，还计划之后买一套公寓给他们住。但在我妈看来，就是我为你们付出这么多，你们怎么这么对我说话这么对待我？我连保姆都不如。\n" +
                        "\n" +
                        "Lucy\n" +
                        "至于说为什么请他们过来，一方面他们愿意来帮我，是因为爱我，另一方面，他们也真的很喜欢孙子。\n" +
                        "\n" +
                        "我现在觉得夹在其中两难。我妈的思维方式我不可能改变，这也是她的底线，我要尊重，可很多时候尊重她的底线意味着牺牲我们自己的底线，我也觉得她的要求不合理，实在没办法满足。另一方面，我老公说话比较冲、有时冒犯的方式改起来也困难，而我老公的底线和理由我一般都是比较认同的。我想根本上解决还是不要住在一起，是很难调和的矛盾。但另一方面，我妈又会给我施加压力，说，养你白养了，养老指不上你了，我们有病都没人管。等等等。我很内疚……\n" +
                        "\n" +
                        "刘未鹏\n" +
                        "妈妈其实内心非常缺少安全感。虽然从表面上来看，是「脆弱」，「说不得」，「尊卑观强烈」「需要孩子顺从」「以自己为中心」等等，但是如果透过这些标签去深入的体会她的内心情感：\n" +
                        "\n" +
                        "为什么当你们说「不要铺软玻璃」她就会爆发了，因为「不要铺软玻璃」=>「不会做事」=>「要被嫌弃了」。\n" +
                        "\n" +
                        "同样的，「不主动把主卧让给我」=>「心里没有装着我这个娘」=>「想抛弃就抛弃我了」。\n" +
                        "\n" +
                        "「妈您别这么说，她还小呢」=>「女婿认为我不会带孩子、没文化」=>「内心肯定是嫌弃我了」。\n" +
                        "\n" +
                        "「不重视我说的话了」=>「不重视我（这个人）了」=>「随时可能抛弃我了」（所以才威胁式的说「你敢去！」，要夺回控制权）\n" +
                        "\n" +
                        "「等老师回家」那件事情，也是类似的，只不过从被家人嫌弃变成了被他人嫌弃。作为一个生存全靠社会关系的那一代人，「不让人嫌」是生存的根本，宁可自己委屈，也不能「不自觉」「惹人嫌弃」。\n" +
                        "\n" +
                        "还记得三川玲写的「不要养出全世界都嫌弃的孩子」一文吗？这是一辈人的集体无意识，这个情感是至为强烈的，是自动的，越过所有的高层认知。但关键是，它曾经（甚至现在）是非常非常functional（注：有功能的，合理的）的，根本不是一种病态，所以想要去「纠正」它就是螳臂当车而已。\n" +
                        "\n" +
                        "因为「被他人认为有价值」太重要太重要了，失去了价值，失去了关系，被嫌弃，无异于死，所以「容不得一点闪失」，所以才会无限放大那些可能意味着要失去你们/被你们嫌弃/被你们轻视的事件，因为人在意一个事情的程度，是「这件事情发生的概率」 乘以「这件事情的后果（的严重程度）」，而你们只看到了「这件事情发生的概率」，所以觉得很困惑（明明我们绝大多数时候都对她很好，怎么这么点事情就那么大反应呢，为什么不想想我们的好呢？），然而实际上因为「不好」的潜在后果太巨大了，无穷大乘以一个小概率常数，结果还是无穷大。人都是优先顾虑生死存亡的事情的，这就像你(wo)坐飞机，注意力总是被坠机的可能抓住，尽管这只是几百万分之一的概率。\n" +
                        "\n" +
                        "所以，从表面上看来好像她总是只注意那些负面的小概率事情、一点也不理性，然而从更深层面看却又是合情合理的。\n" +
                        "\n" +
                        "怎么解开这个结，光靠话术是不行的，这个执念可以轻易的穿透任何话术构成的屏障，因为在无数的经验当中，这一代人早就形成了对他人内心的层层穿透式的揣摩，而且总是做最差的预计（原因如上）。但你又不可能就这样事事顺着他们，因为这样生活也太掣肘了。\n" +
                        "\n" +
                        "所以，剩下的办法：\n" +
                        "\n" +
                        "保持一个觉察，当你们言行上面可能会触发她们的「灾难式」推理的时候，去同时给她们一个爱的（意愿）确认，预先防止他们内心要把这个事情理解成是对她整个人的，预防这个灾难化的自动思维。毕竟她内心真正在意的，是你是不是爱她，是不是不会嫌/弃她，甚至对「被尊重」的执着，其实功能也只是为「不被抛弃」加一个保险。（怎么给她爱的确认，这个就根据个人不一样了，用心感受，总会有办法的）\n" +
                        "\n" +
                        "功夫在诗外，平时找个大家比较有空的时候，好好的敞开来说说掏心窝的话，对他们的愤怒背后的脆弱和伤心表示看见和理解，一次次的给予确认你对她的感情（意愿）。一定要真诚，不要为你老公代言，你老公的心思你也猜不准，也没有说服力，为你自己代言（因为妈妈最在意的是你的意愿），说你未曾说出口的那些话。当你要说一些心里话的时候也需要面对自己内心的脆弱，会感觉自己的脆弱的地方暴露了出来，有一种恐慌，这个时候试着和这个恐慌感同在，并仍然把想说的话说出来。当你不去防御自己的脆弱，从而让妈妈看见你心底里对她的爱，她会感受到你的真诚，因为你们毕竟曾相处了一辈子。甚至说，如果这个世界上还有一个人可能让他感到确定的爱，就是你。",
                    updateTime: "2020-5-20",
                }
            }
        }
    }
</script>

<style scoped>


</style>
